#### Q1. List any five functions of the pandas library with execution.

In [3]:
## 1. dataframe.head() and dataframe.tail()
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
## 2. dataframe.info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
## 3. dataframe.describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
# 4. dataframe.shape
df.shape

(891, 12)

In [8]:
# 5. dataframe.columns
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

> df.reindex(df[1::2])

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [12]:
df = pd.DataFrame({'Values' : [10,20,30,40,50]})

In [16]:
sum1=0
for i in df['Values'][0:3]:
    sum1 = sum1 + i
print(sum1)

60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [17]:
df1 = pd.DataFrame({'Text':['pwskills','data science masters','web dev','java development']})

In [19]:
df1.head()

                   Text
0              pwskills
1  data science masters
2               web dev
3      java development

In [27]:
df1['Word_Count'] = 0

In [28]:
df1.head()

                   Text  Word_Count
0              pwskills           0
1  data science masters           0
2               web dev           0
3      java development           0

In [33]:
df1['Word_Count'] = df1['Text'].str.count(' ') +1

In [34]:
df1.head()

                   Text  Word_Count
0              pwskills           1
1  data science masters           3
2               web dev           2
3      java development           2

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

> DataFrame.size() returns the no. of rows if Series 

> DataFrame.shape returns the dimensionality of dataframe in the form of tuples in which the first number represents the no. of rows and second number represents the no. of columns

#### Q6. Which function of pandas do we use to read an excel file?

> The function used in pandas to read an excel file is :
    
> pd.read_excel()

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [2]:
import pandas as pd
df1 = pd.DataFrame({'Email':['pwskills@gmail.com','datasciencemasters@gmail.com','webdev@gmail.com','javadevelopment@gmail.com']})

In [3]:
df1['Username'] = df1['Email'].str.split('@').str[0]

In [4]:
df1.head()

                          Email            Username
0            pwskills@gmail.com            pwskills
1  datasciencemasters@gmail.com  datasciencemasters
2              webdev@gmail.com              webdev
3     javadevelopment@gmail.com     javadevelopment

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [2]:
import pandas as pd
df2 = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [20]:
df2[(df2['A']>5)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [21]:
df_values = pd.DataFrame({'Values':[1,2,3,4,5,6,7,8,9,10]})

In [29]:
df_values.mean()

Values    5.5
dtype: float64

In [30]:
df_values.median()

Values    5.5
dtype: float64

In [31]:
df_values.std()

Values    3.02765
dtype: float64

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

> I am not able to solve this question

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [37]:
df_date = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})

In [38]:
df_date['Weekday'] = ['Sunday','Monday','Tuesday','Wednesday','Thursday']

In [39]:
df_date.head()

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

> Not able to Understand

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

> To use the basic functions of pandas,the first and foremost necessary library that needs to be imported is 'pandas' library.

> Pandas library includes all the function of pandas like to select few first and last records, to find statiscal analysis,to find information of datatypes a and other info,to find mean,median,standard deviation

> The following are some functions in pandas library:
    1. df.head()
    2. df.tail()
    3. df.info()
    4. df.describe()
    5. df.Series.mean()
    6. df.Series.median()
    7. df.Series.std()
    8. pd.Series() --> to create Series
    9. pd.DataFrame() --> to create DataFrame
    10. df.columns
    11. df.index